In [1]:
import pandas as pd
import numpy as np
import mysql.connector

In [2]:
db = mysql.connector.connect(host='localhost', user='root', password='ganesh2710')

In [3]:
cursor = db.cursor()

In [4]:
try:
    cursor.execute("CREATE DATABASE Pythonexpt10")
except:
    db.rollback()

In [5]:
cursor.execute("SHOW DATABASES")
for x in cursor:
    print(x)

('dbms',)
('information_schema',)
('market',)
('mysql',)
('office',)
('performance_schema',)
('python10',)
('python10miniproject',)
('pythonexpt10',)
('sys',)
('testdb',)

In [6]:
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="ganesh2710",
  database="Pythonexpt10"
)

In [7]:
cursor.execute('USE Pythonexpt10')

In [8]:
df=pd.read_csv('exp10.csv')
df1=df[['region_id', 'country_name','gdp']]
df1

    region_id  country_name           gdp
0         LCN         Aruba  35563.312500
1         SAS   Afghanistan   2057.062256
2         SSF        Angola   8036.690430
3         ECS       Albania  13724.058590
4         ECS       Andorra  43711.800780
..        ...           ...           ...
212       ECS        Kosovo   9723.561523
213       MEA   Yemen, Rep.   8269.671875
214       SSF  South Africa  12666.607420
215       SSF        Zambia   3201.289307
216       SSF      Zimbabwe   3190.506592

[217 rows x 3 columns]

In [9]:
df1=df1.head(5)
df1

  region_id country_name           gdp
0       LCN        Aruba  35563.312500
1       SAS  Afghanistan   2057.062256
2       SSF       Angola   8036.690430
3       ECS      Albania  13724.058590
4       ECS      Andorra  43711.800780

In [10]:
ls=df1.values.tolist()
print(ls)

[['LCN', 'Aruba', 35563.3125], ['SAS', 'Afghanistan', 2057.062256], ['SSF', 'Angola', 8036.69043], ['ECS', 'Albania', 13724.05859], ['ECS', 'Andorra', 43711.80078]]

In [11]:
try:
    cursor.execute(" CREATE TABLE gdp (region_id VARCHAR(100), country_name VARCHAR(100), gdp INT);")
except: 
    db.rollback()

In [12]:
cursor.execute("SHOW TABLES")
for x in cursor:
  print(x)

('gdp',)

In [13]:
sql = "INSERT INTO gdp(region_id, country_name, gdp) VALUES (%s, %s, %s)"
val = ls
cursor.executemany(sql, val)

In [14]:
mydb.commit()
print(cursor.rowcount, "was inserted.")

5 was inserted.

In [15]:
cursor = db.cursor(buffered=True)

In [16]:
cursor.execute("SELECT * FROM gdp")
result = cursor.fetchall()
for x in result:
  print(x)

('LCN', 'Aruba', 35563)
('SAS', 'Afghanistan', 2057)
('SSF', 'Angola', 8037)
('ECS', 'Albania', 13724)
('ECS', 'Andorra', 43712)

In [17]:
sql = "DELETE FROM gdp WHERE region_id='SAS'"
cursor.execute(sql)
mydb.commit()
print(cursor.rowcount, "record(s) deleted")

1 record(s) deleted

In [18]:
cursor.execute("SELECT * FROM gdp")
result = cursor.fetchall()
for x in result:
  print(x)

('LCN', 'Aruba', 35563)
('SSF', 'Angola', 8037)
('ECS', 'Albania', 13724)
('ECS', 'Andorra', 43712)